# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
# алгоритм решения:
# 1. Получаем на ввод номер буквы и заводим переменную с её значением.
# 2. Определяем букву через смену типа вывода.

a = int(input())
print(chr(a))
